[
  {
    "id": "1",
    "title": "Constitutionality of Grievance Appellate Committee under Information Technology Rules, 2021",
    "description": "This article presents a discussion on the internet intermediary liability and the constitutionality of the grievance appellate committee, which is a redressal mechanism provided under the IT(IGDMEC)Rules, 2021 in light of the recent case of X Corp. v. Rajat Sharma, wherein the author argues that the GAC mentioned above and the Rule 3 of the aforementioned Rules of 2021 does not stand the test of constitutionality and the grounds are analyzed in depth for the same.",
    "image": "https://thelawblog.in/wp-content/uploads/2024/07/tlb-saumya.png",
    "content": "In the present times as today wherein every citizen is a digital citizen or digital ‘nagrik‘ the system of accountability, redressal and operations will also have to be digitalized. In an attempt to do so, under the ambit of Information Technology Act, 2000 (herein the Act), the law for holding intermediaries liable has been introduced under Section 79, and the criteria and conditions to hold them liable has been prescribed under the Rule 3 of the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules, 2021 (herein the IT Rules, 2021). When we talk about “digital intermediaries” we include every OTT platform, shopping websites, marketing websites, publication websites and blogs, and others as the contemporary evolution will lay bare.",
    "content1":"But, does every rule made in furtherance of the provisions of the parent act; actually stands the test of constitutionality? Which brings the focus to the provision in question, that is of the Grievance Appellate Committee or the GAC, which is an appellate body as per Rule 3 of the IT Rules, 2021 with whom any internet user aggrieved with the internet intermediaries’ redressal mechanism can make an appeal against such intermediaries. Example: Any user or viewer, aggrieved by any episode of any series broadcasted by Hotstar, which has hurt his sentiments in any prudent manner, may file a complaint against the same with Hotstar or the Star Channels. If such grievance is not solves, then the appeal against the same can be taken up to the GAC. This is only an online redressal system, made for the digital users (the users who avail the service of the intermediaries) of all types of OTT platforms (Netflix, Prime, Hulu) and intermediaries (social media, shop- ping websites, etc). These fall under the larger umbrella of network operators in the cyberspace.  The legislative intent of the IT Rules, 2021 is to put a set of bridle straps to only OTT platforms and media publication websites. Therefore, the constitutionality of the GAC shall be looked vis-à-vis these two effete, different sides of the same coin.",
    "content2":"In Level 1, that is self- regulation, an online intermediary, the publisher must set up a grievance redressal officer who will handle any disputes pertaining to content shared on the platform, such as deepfakes, fabricated data, or fake news. This level serves as a precursor to existing legislation and is the simplest approach to avoid severe government penalties or outright prohibitions.",
    "content3":"Level 2 is where self regulatory bodies are created or the guidelines of the ones already in existence like DMCRC for OTT platforms, COMI for news, etc. are followed for the corresponding entity. This level is in furtherance of level 1 where grievances can be raised on the violations of these guidelines as well and this helps in monitoring and regulating the content furnished on the platform.",
    "content4":"Level 3, the oversight by the Government is where the urgent recommendations are made to the Ministry of Broadcasting and Information for making interim orders, specifically for taking down contents, or any publications which may threaten the internal peace, security, stability of the country, or is offensive and hate speech towards any religious feelings and beliefs, as to prevent any religious rites in the country and to uphold the harmony. But as seen in the OTTS, social media platforms, and other intermediaries including blogs of free and autonomous bodies as well as news channels branches or the print media, such restrictions are used entirely antithetically, that is, to restrict the free expression of opinions and to entirely block any criticism of any authoritative body. Free speech and expression of the media houses and persons is one of the major pillars upon which the Indian Democracy stands, which is now been systematically eroded.",
    "content5":"The provisions of Rule 3 over cedes the provisions of the parent act’s corresponding provisions on the same, that is, regarding due diligence under Section 79 and Section 79(2) wherein the conditions are laid down for observing due diligence. The power of the government to prescribe such conditions on the due diligence specifically, is under Section 89 (2) (zg), which is a very limited power, but the rules has prescribed further additional requirements of due diligence and has also divided the intermediaries into two types, which has no mention in the parent act. Such imposition of extra due diligence criteria and requirements through the rules and also through the division in the types of intermediaries, intends to impose conditions which will make any free speech and expression strenuous. Without fulfillment of such requirements, both the types of intermediaries, including Social Media Intermediary (Rule 2(w)) and Significant Social Media Intermediary (Rule 2(v)) will cause them to face legal repercussions as per the IT Act as well as IPC’s relevant provisions.",
    "content6":"Now, this aforementioned segregation is not being provided for in Section 2(w) which defines intermediaries, read with Section 79 and Section 89 (2) (zg), is also not provided for in the act. Therefore, the rules herein go beyond the provisions of the parent act, making the entire rule 3A unconstitutional, following the Adani Gas Limited judgement, and H. Ganesh Kamath case, wherein it was held and affirmed clearly that any provision which does not confers with and exceeds the provisions of the parent act, is ultra-vires.",
    "content7":"Taking a look on the composition of the 3 GAC levels as mentioned above, at present none of the level is composed including any judicial authority. It includes retired naval officers, retired IPS, retired railway officers and banking heads amongst others, as per the press release of 23 January, 2023. Herein, the retired executive officials are being assigned the judicial tasks, which requires judicial scrutiny as well as an expert opinion that is beyond the scope of the powers granted under the IT Act, 2000 as well as beyond the functions of the executive. It is now well settled by the S. Manoharan case, that no hearing should be conducted without any judicial members, as they have the power, knowledge and responsibility and such hearings shall be void-ab initio. GAC and their hearings are also against the basic jurisprudential principle of Rule of Law and supremacy of law",
    "content8":"This is also causing Article 50 of the constitution to be completely disregarded, that is the attempt to separate the powers and functions of executive and the judiciary. But presently, too much delegation of functions is taking place, thus hampering the efficiency of its implementation. Even rationally, application of judicial mind would be much needed because most of the violations of due diligence is being penalized and punished under the IPC, making such violations a criminal offence, thus keeping judicial members on the GAC board shall work in twofold, that is, reducing the work load of the ministry of broadcasting and information and passing direct orders to curb any menace, rather than further delegation and compromising efficiency.",
    "content9":"Apart from the aforementioned, such strict scrutiny is also cited by the legal advisers of the current government to be a step towards totalitarianism, the same as followed in China which is inspired by North Korean model of censorship. The rule 3 is under the challenge in the Delhi High Court, Karnataka High Court as well. Although the advices and inputs were sought from all the stakeholders before passing the IT Rules, 2021, none heed was paid to thy. Rather, the legal advisers who spoke against the Rules, and stated its adversaries were very gingerly sidelined and were declined any credits, a pure case of “charity begins at home”.",
    "content10":"In conclusion, the entire Rule 3 of the IT Rules 2021 is unconstitutional as it exceeds the provisions and requirements of the parent act, as it restricts the freedom of speech and expression, as the GAC is extending too much judicial function to a non-judicial rather executive bodies, which is violative of Article 50 of the constitution, and that no hearing should be conducted without judicial body, which puts the hearings and the recommendations made after such hearings of GAC under the questionable radar.But with minor though significant changes in the composition of the GAC’s levels, a board chaired by the judicial member, at all three levels, can improve the current scenario and make the hearings compliant with the rule of law as well as be in the interest of meeting the ends of justice, keeping in hindsight that this digital world is the new reality where more presence of people and work is seen than in the physical world, thus more exacting regulatory bodies will have to be formed and hard and fast enforcement of such will have to be done in this virtual field.",
    "author": "Saumya Raj",
    "content11":"Saumya is a final-year student from National University of Study and Research in Law, Ranchi pursuing B.A.LLB with Corporate Law specialization. She has a peculiar interest in Information Technology Law."
  },
  {
    "id": "2",
    "title": "National Court of Appeal and Creation of Regional Benches: Does the Supreme Court Need to Undergo a Structural Re-configuration?",
    "description": "In 2016, a PIL was filed before the Supreme Court, highlighting the need for a structural overhaul at the topmost level of the Indian judicial system. The petitioner sought a writ of mandamus directing the Government of India to take steps towards the establishment of a National Court of Appeal with regional benches in certain parts of the country. The Supreme Court acknowledged that the volume of cases that it has been dealing with has increased substantially over a period of time and that the current Judge strength in the Court is not sufficient to handle this influx of cases. Taking into account that the conversations around the need for reform in the judicial system of the country have been going on for a long time, the Court while referring the matter to a Constitutional Bench for a comprehensive decision, framed eleven substantial questions of law mainly focusing on the issues pertaining to – access to justice; undue delay and pendency of cases; division of Supreme Court into a Constitutional wing and an appellate wing; and the feasibility of establishing regional benches of the Supreme Court. ",
    "image": "https://thelawblog.in/wp-content/uploads/2023/05/raawiah-tlb.png",
    "content": "This conundrum regarding the need for change in the configuration of the Supreme Court is not something that has appeared out of nowhere. Article 130 of the Constitution of India says that “The Supreme Court shall sit in Delhi or in such other place or places, as the Chief Justice of India may, with the approval of the President, from time to time, appoint”. So, by virtue of this provision, the Constitution does provide a mechanism whereby the Supreme Court can maximize its reach and not just remain confined within the contours of the National Capital.",
    "content1": "Further, in the year 1986, in the case of Bihar Legal Support Society Vs. CJI & Anr, Justice Bhagwati had expressed the desire of bifurcating the functions of the Supreme Court, wherein there would be a National Court of Appeal primarily looking at appeals by special leave from the decisions of the High Courts and the Tribunals and the apex court in its present form would be restricted to entertain cases involving questions of Constitutional and Public law. ",
    "content2": "The Law Commission of India in various reports has also recommended the separation of the Constitutional and legal functions of the Supreme Court ( 95th Report, 1984) as well as emphasized the need to set up regional benches of the Court to increase its accessibility (125th Report, 1988). Thereafter, in 2009, in its 229th Report, the Commission recommended setting up four cassation benches, divided into North (New Delhi), South (Chennai), East (Kolkata), and West (Mumbai).",
    "content3": "Even the Executive at various points in the past has exhibited an inclination towards such a modification. In 2019, Vice President Venkaiah Naidu advocated for the need for regional benches of the Supreme Court in at least four major cities. Thereafter, in March 2021, the Parliament Standing Committee on Personnel, Public Grievances, Law and Justice in its 107th report, while reiterating the recommendations of the Law Commission, emphasized the need for easy access to justice which would only remain a distant dream as long as the Supreme Court was out of reach for people from far-flung and remote areas of the country. ",
    "content4": "If one tries to understand the cumulative effect of these proposals, the dominant idea that seems to emerge is that there should be a functional division of the Supreme Court whereby the apex court will function in two distinct capacities: Constitutional and legal, with regional benches at certain major cities to make the Supreme Court readily accessible to people residing across the length and breadth of the country.",
    "content5": "There are essentially two primary arguments that can be put forward in support of the need for this reform. First, is the principle of access to justice, and second, the dilution of the Constitutional functions of the Supreme Court.In its most basic sense access to justice can be understood as the ease with which any person can approach the judiciary to get his grievances addressed. In July 2016, the Constitution Bench of the Supreme Court in Anita Khushwa v. Pushpa Sadan, while reiterating that access to justice is a fundamental right under Article 21, further elaborated that it may as well be a facet of equality under Article 14. It stated that “The citizen’s inability to access courts or any other adjudicatory mechanism provided for determination of rights and obligations is bound to result in denial of the guarantee contained in Article 14 both in relation to equality before law as well as equal protection of laws”. Further, the court delineated four essential facets of this principle – an effective adjudicatory mechanism; accessibility of this mechanism in terms of distance; speedy adjudication; and affordable access to the adjudicatory process.",
    "content6": "It is in this context that one needs to understand the growing clamour for reform in the structural working of the Supreme Court. As the various Law Commission reports point out, the fact that the seat of the Supreme Court is circumscribed within Delhi adversely affects potential litigants coming from areas far off areas of the country. For a substantial number of such litigants, it is not financially viable to bear the expenses involved in going to the National Capital and fighting the case there. The fees of lawyers handling cases at the Supreme Court is nevertheless high. Adding to this the cost of travelling in and out of Delhi, especially considering adjournments and other delays becomes both logistically and financially unfeasible for a large part of the Indian population. In light of the fact that the Supreme Court has recognized access to justice as a Fundamental Right, the exclusive seat of the Supreme Court in Delhi creates an anomaly as the very institution that the people are supposed to approach for seeking justice is not within their reach. ",
    "content7": "Other than being a Constitutional court, the Supreme Court under Article 136 has a special leave jurisdiction to take up appeals against any judgment, determination, sentence, or order of any Court or Tribunal within India. In the year 1950, in the case of Pritam Singh v. The State acknowledging the immense discretionary power granted to it, the Supreme Court emphasized the need to exercise its special leave jurisdiction in “exceptional” and “special” circumstances. A similar stand was taken by the Court in the case of Mathai @ Joby vs George, wherein while referring the matter to the Constitution Bench the court observed that “if the Supreme Court entertains all and sundry kinds of cases it will soon be flooded with a huge amount of backlog and will not be able to deal with important questions relating to the Constitution or the law or where grave injustice has been done, for which it was really meant under the constitutional scheme”. However, the Constitution Bench while declining to look into the question of interpretation of Article 136 observed that while it is true that there is a need to use the powers given to the Court by virtue of this Article with circumspection, there is no question of limiting such power as it would go against the interest of justice.",
    "content8": "In the current scenario the Supreme Court is dealing with a huge volume of cases under Article 136 and has consequently to a large extent converted itself into a regular court of appeal, leading to undue delay and backlog of cases and consequently affecting the efficiency of the apex court’s justice delivery mechanism both in the Constitutional and the appellate sphere. Hence, a systematic bifurcation of the Constitutional and appellate functions of the court along with the setting up of regional benches could be a potential solution whereby the court could continue using its discretion under Article 136 as and when it deems fit as envisioned by the Constitutional Bench in Mathai but at the same time these appeals would not in any way impact or overshadow the vital Constitutional functions of the Court. A somewhat similar reform was seen in Ireland in 2014 with the establishment of the Court of Appeal as an additional jurisdictional tier between the High Court and the Supreme Court. Now the only appeals that go to the Supreme Court in Ireland are those which raise issues of major public importance or where such an appeal is necessary for the interests of justice. ",
    "content9": "Conclusion:",
    "content10": "While the initiation of virtual hearings by the courts during the pandemic is being seen by some as a reasonable solution to increase the accessibility of the Supreme Court, it does not provide an answer to the need for bifurcating the Constitutional and appellate functions of the Supreme Court. Further, considering the surprising stand taken by the Union of India contending that the proposed National Court of Appeal or Regional Courts of Appeal are neither “constitutionally permissible nor otherwise feasible”, it would be interesting to see how the Constitution Bench answers the issues raised in the case, especially in view of the fact that the court itself has recognized access to justice as a fundamental right as well as conceded that the clutter of cases over the past few decades has impeded the efficient functioning of the apex court.",
    "author": "Raawiah Mansoor",
    "content11": "Raawiah is a final year student at ILS Law College, Pune with a keen interest in Corporate and Commercial Laws as well as the regime of Competition Law."
  },
  {
    "id": "3",
    "title": "Nata Vivah (Marriage) and Maintenance related issues under Section 125 CrPC",
    "description": "According to this custom, in some tribes the woman (wife) can leave her husband and live with another man. This is called Nata. No formal rituals have to be done in this. There is only mutual consent. This practice is prevalent even today in many tribal communities in Rajasthan. This practice is quite similar to the live-in relationship of the modern society. It is said that Nata Pratha was created to give recognition to widows and abandoned women to lead a social life, which is still believed today.",
    "image": "https://thelawblog.in/wp-content/uploads/2023/04/tlb-harshit-3.png",
    "content": "Under this system, no formal marriage ceremony is required to live together. Couple can perform all obligations of husband and wife without entering into wedlock. According to the practice, man has to pay money to live a modern day live-in relationship with a woman of his choice, after the woman’s first husband walks out of the marriage and pass on his wife to other man in return for money. This money, the “bride price” is fixed by members of the community, or middlemen, who may receive a cut for doing so. The sum may range from a few thousand bucks to even a few lakhs depending upon the paying capacity of the person concerned.[i]",
    "content1": "For ex. If a man wants to live with a woman who is already married than he has to pay some amount of money to the woman’s husband. After satisfied with the amount the husband of the woman releases her and then the lady can live with the other man who paid the price. This is called Nata.The problem that arises in Nata cases is that of Maintenance. Since the woman has left her legally wedded husband and started to live with another man, is she entitled to claim maintenance from him?",
    "content2": "Introduction-Object and Scope of Section 125 CrPC",
    "content3": "There are different statutes providing for making an application for grant of maintenance/ interim maintenance, if any person having sufficient means neglects, or refuses to maintain his wife, children, parents. The different enactments provide an independent and distinct remedy framed with a specific object and purpose. Maintenance laws have been enacted as a measure of social justice to provide recourse to dependant wives and children for their financial support, so as to prevent them from falling into destitution and vagrancy.",
    "content4": "Article 15(3) of the Constitution[ii] of India provides that: “Nothing in this article shall prevent the State from making any special provision for women and children.” Article 15 (3) reinforced by Article 39 of the Constitution of India[iii], which envisages a positive role for the State in fostering change towards the empowerment of women, led to the enactment of various legislations from time to time.Justice Krishna Iyer in his judgment in Captain Ramesh Chander Kaushal v Mrs. Veena Kaushal & Ors[iv]. held that the object of maintenance laws is:",
    "content5": "“9. This provision is a measure of social justice and specially enacted to protect women and children and falls within the constitutional sweep of Article 15(3) reinforced by Article 39. We have no doubt that sections of statutes calling for construction by courts are not petrified print but vibrant words with social functions to fulfil. The brooding presence of the constitutional empathy for the weaker sections like women and children must inform interpretation if it has to have social relevance. So viewed, it is possible to be selective in picking out that interpretation out of two alternatives which advances the cause- the cause of the derelicts.”",
    "content6": "The legislations which have been framed on the issue of maintenance are the Special Marriage Act 1954 (“SMA”), Section 125 of the Cr.P.C. 1973; and the Protection of Women from Domestic Violence Act, 2005 (“D.V. Act”) which provide a statutory remedy to women, irrespective of the religious community to which they belong, apart from the personal laws applicable to various religious communities.In Badshah v Urmila Badshah Godse[v], the Supreme Court was considering the interpretation of Section 125 CrPC. The Court held:",
    "content7": "“13.3. …purposive interpretation needs to be given to the provisions of Section 125 CrPC. While dealing with the application of a destitute wife or hapless children or parents under this provision, the Court is dealing with the marginalised sections of the society. The purpose is to achieve “social justice” which is the constitutional vision, enshrined in the Preamble of the Constitution of India. The Preamble to the Constitution of India clearly signals that we have chosen the democratic path under the rule of law to achieve the goal of securing for all its citizens, justice, liberty, equality and fraternity. It specifically highlights achieving their social justice. Therefore, it becomes the bounden duty of the courts to advance the cause of the social justice. While giving interpretation to a particular provision, the court is supposed to bridge the gap between the law and society.”",
    "content8": "Maintenance in cases of Nata Vivah",
    "content9": "In Boli Narayan vs Shiddheswari Morang[vii] it was stated that Section 125 of the CrPC makes it clear that it is a measure of social justice to ensure protection to wives, children and parents. It falls within the sweep of Articles 15(3) and 39 of the Constitution and is the core of the fundamental duties enshrined in Article 51A and the legislative inspiration is drawn from the Preamble to the Constitution which provides for securing social justice to all. The code words printed must be explicated to enable the provision to fulfil its social function which is the generating force for enacting the provision. The constitutional compassion for the weaker sections calls for an interpretation having social relevance. When alternative meanings may be advanced in interpreting a word and both are reasonable, the meaning which promotes or proffers the cause of the derelicts should be accepted. Wives as well as divorcees are entitled to maintenance. The entitlement is obtainable when the bonds of marriage are still there as well as when it is snapped by divorce where the marriage link is ruptured. Existence of a marriage knot is, therefore, not the condition precedent for such entitlement. A wife and an ex-wife are equally entitled to maintenance subject to the limitation contained in Section 125. To discern the question posed, it is necessary to ponder why the Legislature applied the term “wife” and not the expressions “legally married wife” or a married wife.",
    "content10": "A woman who comes in the life of a man, gives herself to the man, takes the family-life of the man and the man uses her as such, recognises her as his wife, must come within the fold of the term “wife”, absence of ceremonial marriage notwithstanding. Acceptance of a woman as a wife, declaration of the status directly or indirectly and acceptance of status by the woman are enough to bring her within the purview of Section 125. The view serves “the social purpose’ for which the Section has been enacted. To reject it would exclude woman living as wife, giving her life for the man but not validly married to be excluded from the scope of the section.",
    "author": "Harshit Sharma",
    "content11": "Harshit is a Civil Judge-cum-JMFC at Rajasthan Judicial Services, and a doctoral candidate (Ph.D.) at NLU Jodhpur. He can be reached at harshitsharmanluj@gmail.com."
  },
  {
    "id": "4",
    "title": "Cybersecurity Laws and You",
    "description": "How cybersecurity laws impact individuals and businesses.",
    "image": "https://thelawblog.in/wp-content/uploads/2020/05/paper-3033204_1280.jpg",
    "content": "",
    "content1": "",
    "content2": "",
    "content3": "",
    "content4": "",
    "content5": "",
    "content6": "",
    "content7": "",
    "content8": "",
    "content9": "",
    "content10": "",
    "author": "Alex Johnson",
    "content11": ""
  },
  {
    "id": "5",
    "title": "Navigating Property Disputes",
    "description": "A guide to resolving property disputes effectively.",
    "image": "https://thelawblog.in/wp-content/uploads/2020/10/the-law-blog.png",
    "content": "",
    "content1": "",
    "content2": "",
    "content3": "",
    "content4": "",
    "content5": "",
    "content6": "",
    "content7": "",
    "content8": "",
    "content9": "",
    "content10": "",
    "author": "Alex Johnson",
    "content11": ""
  },
  {
    "id": "6",
    "title": "Intellectual Property Rights Explained",
    "description": "Protecting your creations with intellectual property rights.",
    "image": "https://thelawblog.in/wp-content/uploads/2021/12/tlb-pallavi-et-al.png",
   "content": "",
    "content1": "",
    "content2": "",
    "content3": "",
    "content4": "",
    "content5": "",
    "content6": "",
    "content7": "",
    "content8": "",
    "content9": "",
    "content10": "",
    "author": "Alex Johnson",
    "content11": ""
  },
  {
    "id": "7",
    "title": "Labor Laws: An Employee's Perspective",
    "description": "Understanding your rights as an employee.",
    "image": "https://thelawblog.in/wp-content/uploads/2017/10/france-2690716_960_720.jpg",
    "content": "",
    "content1": "",
    "content2": "",
    "content3": "",
    "content4": "",
    "content5": "",
    "content6": "",
    "content7": "",
    "content8": "",
    "content9": "",
    "content10": "",
    "author": "Alex Johnson",
    "content11": ""
  },
  {
    "id": "8",
    "title": "Consumer Protection Laws Simplified",
    "description": "How consumer laws shield you from fraud.",
    "image": "https://thelawblog.in/wp-content/uploads/2020/08/environmental-protection-683437_1280.jpg",
    "content": "",
    "content1": "",
    "content2": "",
    "content3": "",
    "content4": "",
    "content5": "",
    "content6": "",
    "content7": "",
    "content8": "",
    "content9": "",
    "content10": "",
    "author": "Alex Johnson",
    "content11": ""
  },
  {
    "id": "9",
    "title": "The Role of Mediation in Legal Disputes",
    "description": "How mediation offers an alternative to litigation.",
    "image": "https://thelawblog.in/wp-content/uploads/2018/03/agree-1728448_960_720.jpg",
    "content": "",
    "content1": "",
    "content2": "",
    "content3": "",
    "content4": "",
    "content5": "",
    "content6": "",
    "content7": "",
    "content8": "",
    "content9": "",
    "content10": "",
    "author": "Alex Johnson",
    "content11": ""
  }]